### Contents

- [Configurations and Libraries](#Configurations-and-Libraries)
- [Functions](#Functions)

### Configurations and Libraries

In [1]:
# user configuration

In [2]:
# import libraries

# maths
import scipy.stats as stats
import numpy as np
import pandas as pd
#from pandas.api.types import is_numeric_dtype

# visual
# import seaborn as sns
# import matplotlib.pyplot as plt
# from matplotlib_venn import venn2
# %matplotlib inline

# others
import time
import datetime as dt
import re
import os

In [3]:
# file paths

input_path = '../data/1_input/'
clean_path = '../data/2_clean/'
output_path = '../data/3_output/'

folders = ['Fitabase Data 3.12.16-4.11.16','Fitabase Data 4.12.16-5.12.16']

### Functions

### Import Data

In [4]:
# get file names from folders

for folder in folders:
    
    print(folder,':')
    
    files = os.listdir(input_path + folder)
    
    for file in files:
        print(file)
        
    print('')

Fitabase Data 3.12.16-4.11.16 :
dailyActivity_merged.csv
heartrate_seconds_merged.csv
hourlyCalories_merged.csv
hourlyIntensities_merged.csv
hourlySteps_merged.csv
minuteCaloriesNarrow_merged.csv
minuteIntensitiesNarrow_merged.csv
minuteMETsNarrow_merged.csv
minuteSleep_merged.csv
minuteStepsNarrow_merged.csv
weightLogInfo_merged.csv

Fitabase Data 4.12.16-5.12.16 :
dailyActivity_merged.csv
dailyCalories_merged.csv
dailyIntensities_merged.csv
dailySteps_merged.csv
heartrate_seconds_merged.csv
hourlyCalories_merged.csv
hourlyIntensities_merged.csv
hourlySteps_merged.csv
minuteCaloriesNarrow_merged.csv
minuteCaloriesWide_merged.csv
minuteIntensitiesNarrow_merged.csv
minuteIntensitiesWide_merged.csv
minuteMETsNarrow_merged.csv
minuteSleep_merged.csv
minuteStepsNarrow_merged.csv
minuteStepsWide_merged.csv
sleepDay_merged.csv
weightLogInfo_merged.csv

In [5]:
# import data from folders[0] -> create df_xxx

df_activity = pd.read_csv(input_path + folders[0] + '/dailyActivity_merged.csv')
df_weight = pd.read_csv(input_path + folders[0] + '/weightLogInfo_merged.csv')

df_hr_s = pd.read_csv(input_path + folders[0] + '/heartrate_seconds_merged.csv')

df_calories_m = pd.read_csv(input_path + folders[0] + '/minuteCaloriesNarrow_merged.csv')
df_intense_m = pd.read_csv(input_path + folders[0] + '/minuteIntensitiesNarrow_merged.csv')
df_mets_m = pd.read_csv(input_path + folders[0] + '/minuteMETsNarrow_merged.csv')
df_steps_m = pd.read_csv(input_path + folders[0] + '/minuteStepsNarrow_merged.csv')

df_calories_h = pd.read_csv(input_path + folders[0] + '/hourlyCalories_merged.csv')
df_intense_h = pd.read_csv(input_path + folders[0] + '/hourlyIntensities_merged.csv')
df_steps_h = pd.read_csv(input_path + folders[0] + '/hourlySteps_merged.csv')

In [6]:
# import data from folders[1] -> create df_xxx_2

### Inspect Raw Data

In [7]:
# print df_xxx size

print('df_activity',df_activity.shape)
print('df_weight',df_weight.shape)
print('')
print('df_hr_s',df_hr_s.shape)
print('')
print('df_calories_m',df_calories_m.shape)
print('df_intense_m',df_intense_m.shape)
print('df_mets_m',df_mets_m.shape)
print('df_steps_m',df_steps_m.shape)
print('')
print('df_calories_h',df_calories_h.shape)
print('df_intense_h',df_intense_h.shape)
print('df_steps_h',df_steps_h.shape)

df_activity (457, 15)
df_weight (33, 8)

df_hr_s (1154681, 3)

df_calories_m (1445040, 3)
df_intense_m (1445040, 3)
df_mets_m (1445040, 3)
df_steps_m (1445040, 3)

df_calories_h (24084, 3)
df_intense_h (24084, 4)
df_steps_h (24084, 3)

In [8]:
print(df_activity['Id'].nunique())

df_activity.head()

35

,Id,ActivityDate,TotalSteps,TotalDistance,TrackerDistance,LoggedActivitiesDistance,VeryActiveDistance,ModeratelyActiveDistance,LightActiveDistance,SedentaryActiveDistance,VeryActiveMinutes,FairlyActiveMinutes,LightlyActiveMinutes,SedentaryMinutes,Calories
0,1503960366,3/25/2016,11004,7.11,7.11,0.0,2.57,0.46,4.07,0.0,33,12,205,804,1819
1,1503960366,3/26/2016,17609,11.55,11.55,0.0,6.92,0.73,3.91,0.0,89,17,274,588,2154
2,1503960366,3/27/2016,12736,8.53,8.53,0.0,4.66,0.16,3.71,0.0,56,5,268,605,1944
3,1503960366,3/28/2016,13231,8.93,8.93,0.0,3.19,0.79,4.95,0.0,39,20,224,1080,1932
4,1503960366,3/29/2016,12041,7.85,7.85,0.0,2.16,1.09,4.61,0.0,28,28,243,763,1886

In [9]:
# Check for nulls in columns

null_cols = df_activity.isnull().sum()
mask_null = null_cols > 0
null_cols[mask_null].sort_values(ascending=False)

Series([], dtype: int64)

In [10]:
print(df_weight['Id'].nunique())
print('only 11 out of 35 participators have weight data.')

df_weight.head()

11
only 11 out of 35 participators have weight data.

,Id,Date,WeightKg,WeightPounds,Fat,BMI,IsManualReport,LogId
0,1503960366,4/5/2016 11:59:59 PM,53.299999,117.506384,22.0,22.969999,True,1459900799000
1,1927972279,4/10/2016 6:33:26 PM,129.600006,285.719105,NaN,46.169998,False,1460313206000
2,2347167796,4/3/2016 11:59:59 PM,63.400002,139.773078,10.0,24.770000,True,1459727999000
3,2873212765,4/6/2016 11:59:59 PM,56.700001,125.002104,NaN,21.450001,True,1459987199000
4,2873212765,4/7/2016 11:59:59 PM,57.200001,126.104416,NaN,21.650000,True,1460073599000

In [11]:
# Check for nulls in columns

null_cols = df_weight.isnull().sum()
mask_null = null_cols > 0
null_cols[mask_null].sort_values(ascending=False)

print('drop Fat column later. Too many null values.')

drop Fat column later. Too many null values.

In [12]:
df_weight_summary = df_weight.groupby('Id')['IsManualReport'].value_counts()
print(df_weight_summary)
print('')
df_weight_summary_2 = df_weight['IsManualReport'].value_counts()
print(df_weight_summary_2)
print('')
print('9 out of 11 participators input their own weight data (manual).')
print('Most participators recorded their weight 1-2 monthly.')

Id          IsManualReport
1503960366  True               1
1927972279  False              1
2347167796  True               1
2873212765  True               2
2891001357  True               1
4445114986  True               1
4558609924  True               1
4702921684  True               1
6962181067  True              14
8253242879  True               1
8877689391  False              9
Name: IsManualReport, dtype: int64

True     23
False    10
Name: IsManualReport, dtype: int64

9 out of 11 participators input their own weight data (manual).
Most participators recorded their weight 1-2 monthly.

In [13]:
df_hr_s.head()

           Id                 Time  Value
0  2022484408  4/1/2016 7:54:00 AM     93
1  2022484408  4/1/2016 7:54:05 AM     91
2  2022484408  4/1/2016 7:54:10 AM     96
3  2022484408  4/1/2016 7:54:15 AM     98
4  2022484408  4/1/2016 7:54:20 AM    100

In [14]:
df_calories_m.head()

           Id         ActivityMinute  Calories
0  1503960366  3/12/2016 12:00:00 AM    0.7973
1  1503960366  3/12/2016 12:01:00 AM    0.7973
2  1503960366  3/12/2016 12:02:00 AM    0.7973
3  1503960366  3/12/2016 12:03:00 AM    0.7973
4  1503960366  3/12/2016 12:04:00 AM    0.7973

In [15]:
df_intense_m.head()

           Id         ActivityMinute  Intensity
0  1503960366  3/12/2016 12:00:00 AM          0
1  1503960366  3/12/2016 12:01:00 AM          0
2  1503960366  3/12/2016 12:02:00 AM          0
3  1503960366  3/12/2016 12:03:00 AM          0
4  1503960366  3/12/2016 12:04:00 AM          0

In [16]:
df_mets_m.head()

           Id         ActivityMinute  METs
0  1503960366  3/12/2016 12:00:00 AM    10
1  1503960366  3/12/2016 12:01:00 AM    10
2  1503960366  3/12/2016 12:02:00 AM    10
3  1503960366  3/12/2016 12:03:00 AM    10
4  1503960366  3/12/2016 12:04:00 AM    10

In [17]:
df_steps_m.head()

           Id         ActivityMinute  Steps
0  1503960366  3/12/2016 12:00:00 AM      0
1  1503960366  3/12/2016 12:01:00 AM      0
2  1503960366  3/12/2016 12:02:00 AM      0
3  1503960366  3/12/2016 12:03:00 AM      0
4  1503960366  3/12/2016 12:04:00 AM      0

In [18]:
df_calories_h.head()

           Id           ActivityHour  Calories
0  1503960366  3/12/2016 12:00:00 AM        48
1  1503960366   3/12/2016 1:00:00 AM        48
2  1503960366   3/12/2016 2:00:00 AM        48
3  1503960366   3/12/2016 3:00:00 AM        48
4  1503960366   3/12/2016 4:00:00 AM        48

In [19]:
df_intense_h.head()

           Id           ActivityHour  TotalIntensity  AverageIntensity
0  1503960366  3/12/2016 12:00:00 AM               0               0.0
1  1503960366   3/12/2016 1:00:00 AM               0               0.0
2  1503960366   3/12/2016 2:00:00 AM               0               0.0
3  1503960366   3/12/2016 3:00:00 AM               0               0.0
4  1503960366   3/12/2016 4:00:00 AM               0               0.0

In [20]:
df_steps_h.head()

           Id           ActivityHour  StepTotal
0  1503960366  3/12/2016 12:00:00 AM          0
1  1503960366   3/12/2016 1:00:00 AM          0
2  1503960366   3/12/2016 2:00:00 AM          0
3  1503960366   3/12/2016 3:00:00 AM          0
4  1503960366   3/12/2016 4:00:00 AM          0

### Merge Data

In [21]:
# merge df_xxx_m -> df_m

cols = ['Id','ActivityMinute']

df_m = df_calories_m.merge(df_intense_m, on=cols)
df_m = df_m.merge(df_mets_m, on=cols)
df_m = df_m.merge(df_steps_m, on=cols)

In [22]:
# merge df_xxx_h -> df_h

cols = ['Id','ActivityHour']

df_h = df_calories_h.merge(df_intense_h, on=cols)
df_h = df_h.merge(df_steps_h, on=cols)

### Inspect Merged Data

In [23]:
df_m.head()

           Id         ActivityMinute  Calories  Intensity  METs  Steps
0  1503960366  3/12/2016 12:00:00 AM    0.7973          0    10      0
1  1503960366  3/12/2016 12:01:00 AM    0.7973          0    10      0
2  1503960366  3/12/2016 12:02:00 AM    0.7973          0    10      0
3  1503960366  3/12/2016 12:03:00 AM    0.7973          0    10      0
4  1503960366  3/12/2016 12:04:00 AM    0.7973          0    10      0

In [24]:
df_h.head()

,Id,ActivityHour,Calories,TotalIntensity,AverageIntensity,StepTotal
0,1503960366,3/12/2016 12:00:00 AM,48,0,0.0,0
1,1503960366,3/12/2016 1:00:00 AM,48,0,0.0,0
2,1503960366,3/12/2016 2:00:00 AM,48,0,0.0,0
3,1503960366,3/12/2016 3:00:00 AM,48,0,0.0,0
4,1503960366,3/12/2016 4:00:00 AM,48,0,0.0,0

In [25]:
# Check for nulls in columns

null_cols = df_m.isnull().sum()
mask_null = null_cols > 0
null_cols[mask_null].sort_values(ascending=False)

Series([], dtype: int64)

In [26]:
# Check for nulls in columns

null_cols = df_h.isnull().sum()
mask_null = null_cols > 0
null_cols[mask_null].sort_values(ascending=False)

Series([], dtype: int64)

### Clean Data

In [27]:
# drop columns
cols = ['WeightPounds','Fat','LogId']
df_weight.drop(columns=cols,inplace=True)

In [28]:
# BMI = Weight (kg) / Height^2 (m2) 
# Height = sqrt(Weight/BMI)

df_weight['Height'] =  np.sqrt(df_weight['WeightKg']/df_weight['BMI']) * 100
df_weight

,Id,Date,WeightKg,BMI,IsManualReport,Height
0,1503960366,4/5/2016 11:59:59 PM,53.299999,22.969999,True,152.329182
1,1927972279,4/10/2016 6:33:26 PM,129.600006,46.169998,False,167.541571
2,2347167796,4/3/2016 11:59:59 PM,63.400002,24.770000,True,159.985870
3,2873212765,4/6/2016 11:59:59 PM,56.700001,21.450001,True,162.584027
4,2873212765,4/7/2016 11:59:59 PM,57.200001,21.650000,True,162.543299
5,2891001357,4/5/2016 11:59:59 PM,88.400002,25.030001,True,187.929823
6,4445114986,3/30/2016 11:59:59 PM,92.400002,35.009998,True,162.457567
7,4558609924,4/8/2016 11:59:59 PM,69.400002,27.139999,True,159.909705
8,4702921684,4/4/2016 11:59:59 PM,99.699997,26.110001,True,195.408806
9,6962181067,3/30/2016 11:59:59 PM,61.500000,24.030001,True,159.978149
10,6962181067,3/31/2016 11:59:59 PM,61.500000,24.030001,True,159.978149
11,6962181067,4/1/2016 11:59:59 PM,60.900002,23.780001,True,160.030485
12,6962181067,4/2/2016 11:59:59 PM,61.200001,23.889999,True,160.054410
13,6962181067,4/3/2016 11:59:59 PM,61.500000,24.030001,True,159.978149
14,6962181067,4/4/2016 11:59:59 PM,62.400002,24.350000,True,160.082115
15,6962181067,4/5/2016 11:59:59 PM,61.700001,24.100000,True,160.005186
16,6962181067,4/6/2016 11:59:59 PM,62.200001,24.280001,True,160.055590
17,6962181067,4/7/2016 11:59:59 PM,62.200001,24.280001,True,160.055590
18,6962181067,4/8/2016 11:59:59 PM,61.700001,24.100000,True,160.005186
19,6962181067,4/9/2016 11:59:59 PM,62.099998,24.240000,True,160.058775
20,6962181067,4/10/2016 11:59:59 PM,62.500000,24.389999,True,160.078908
21,6962181067,4/11/2016 11:59:59 PM,62.200001,24.280001,True,160.055590
22,6962181067,4/12/2016 11:59:59 PM,62.500000,24.389999,True,160.078908
23,8253242879,4/7/2016 11:59:59 PM,75.599998,29.549999,True,159.949231
24,8877689391,4/1/2016 6:49:40 AM,85.500000,25.610001,False,182.716708
25,8877689391,4/4/2016 6:53:43 AM,86.599998,25.940001,False,182.714895
26,8877689391,4/5/2016 6:40:15 AM,86.000000,25.760000,False,182.715880
27,8877689391,4/6/2016 6:49:31 AM,86.300003,25.830000,False,182.786115
28,8877689391,4/7/2016 6:15:08 AM,85.099998,25.490000,False,182.717380
29,8877689391,4/8/2016 6:39:44 AM,85.000000,25.440001,False,182.789357
30,8877689391,4/9/2016 8:06:12 AM,85.400002,25.559999,False,182.788353
31,8877689391,4/11/2016 6:58:09 AM,86.099998,25.790001,False,182.715711
32,8877689391,4/12/2016 6:47:11 AM,85.800003,25.680000,False,182.787351

### Edit Columns

In [29]:
# use lowercase for column names

df_activity.columns = map(str.lower, df_activity.columns)
df_weight.columns = map(str.lower, df_weight.columns)
df_hr_s.columns = map(str.lower, df_hr_s.columns)
df_m.columns = map(str.lower, df_m.columns)
df_h.columns = map(str.lower, df_h.columns)

In [30]:
# print column names

print(df_activity.columns)
print('')
print(df_weight.columns)
print('')
print(df_hr_s.columns)
print('')
print(df_m.columns)
print('')
print(df_h.columns)

Index(['id', 'activitydate', 'totalsteps', 'totaldistance', 'trackerdistance',
       'loggedactivitiesdistance', 'veryactivedistance',
       'moderatelyactivedistance', 'lightactivedistance',
       'sedentaryactivedistance', 'veryactiveminutes', 'fairlyactiveminutes',
       'lightlyactiveminutes', 'sedentaryminutes', 'calories'],
      dtype='object')

Index(['id', 'date', 'weightkg', 'bmi', 'ismanualreport', 'height'], dtype='object')

Index(['id', 'time', 'value'], dtype='object')

Index(['id', 'activityminute', 'calories', 'intensity', 'mets', 'steps'], dtype='object')

Index(['id', 'activityhour', 'calories', 'totalintensity', 'averageintensity',
       'steptotal'],
      dtype='object')

In [31]:
# rename columns

df_activity = df_activity.rename(columns={
                            'activitydate':'timestamp',
                            'totalsteps':'steps',
                            'totaldistance':'dist_total',
                            'trackerdistance':'dist_track', 
                            'loggedactivitiesdistance':'dist_log',   
                            'veryactivedistance':'dist_act_high',   
                            'moderatelyactivedistance':'dist_act_med',   
                            'lightactivedistance':'dist_act_low',
                            'sedentaryactivedistance':'dist_act_zero',
                            'veryactiveminutes':'mins_act_high',
                            'fairlyactiveminutes':'mins_act_med',
                            'lightlyactiveminutes':'mins_act_low',
                            'sedentaryminutes':'mins_act_zero',
                            })

df_weight = df_weight.rename(columns={
                            'date':'timestamp',
                            'weightkg':'weight',
                            'ismanualreport':'manual'                           
                            })

df_hr_s = df_hr_s.rename(columns={
                            'time':'timestamp',
                            'value':'hr',              
                            })

df_m = df_m.rename(columns={'activityminute':'timestamp'})

df_h = df_h.rename(columns={
                            'activityhour':'timestamp',
                            'totalintensity':'intensity_total',
                            'averageintensity':'intensity_avg',
                            'steptotal':'steps' 
                            })

In [32]:
# print column names

print(df_activity.columns)
print('')
print(df_weight.columns)
print('')
print(df_hr_s.columns)
print('')
print(df_m.columns)
print('')
print(df_h.columns)

Index(['id', 'timestamp', 'steps', 'dist_total', 'dist_track', 'dist_log',
       'dist_act_high', 'dist_act_med', 'dist_act_low', 'dist_act_zero',
       'mins_act_high', 'mins_act_med', 'mins_act_low', 'mins_act_zero',
       'calories'],
      dtype='object')

Index(['id', 'timestamp', 'weight', 'bmi', 'manual', 'height'], dtype='object')

Index(['id', 'timestamp', 'hr'], dtype='object')

Index(['id', 'timestamp', 'calories', 'intensity', 'mets', 'steps'], dtype='object')

Index(['id', 'timestamp', 'calories', 'intensity_total', 'intensity_avg',
       'steps'],
      dtype='object')

In [33]:
# reorder df columns

cols = ['id', 'timestamp', 'steps', 'calories',
        'dist_total', 'dist_track', 'dist_log',
       'dist_act_high', 'dist_act_med', 'dist_act_low', 'dist_act_zero',
       'mins_act_high', 'mins_act_med', 'mins_act_low', 'mins_act_zero',]
df_activity = df_activity[cols]

cols = ['id', 'timestamp','manual','height','weight', 'bmi']
df_weight = df_weight[cols]

cols = ['id', 'timestamp','steps', 'calories', 'intensity', 'mets']
df_m = df_m[cols]

cols = ['id', 'timestamp','steps','calories','intensity_total', 'intensity_avg',]
df_h = df_h[cols]

In [34]:
df_activity.head()

,id,timestamp,steps,calories,dist_total,dist_track,dist_log,dist_act_high,dist_act_med,dist_act_low,dist_act_zero,mins_act_high,mins_act_med,mins_act_low,mins_act_zero
0,1503960366,3/25/2016,11004,1819,7.11,7.11,0.0,2.57,0.46,4.07,0.0,33,12,205,804
1,1503960366,3/26/2016,17609,2154,11.55,11.55,0.0,6.92,0.73,3.91,0.0,89,17,274,588
2,1503960366,3/27/2016,12736,1944,8.53,8.53,0.0,4.66,0.16,3.71,0.0,56,5,268,605
3,1503960366,3/28/2016,13231,1932,8.93,8.93,0.0,3.19,0.79,4.95,0.0,39,20,224,1080
4,1503960366,3/29/2016,12041,1886,7.85,7.85,0.0,2.16,1.09,4.61,0.0,28,28,243,763

In [35]:
df_weight.head()

           id             timestamp  manual      height      weight        bmi
0  1503960366  4/5/2016 11:59:59 PM    True  152.329182   53.299999  22.969999
1  1927972279  4/10/2016 6:33:26 PM   False  167.541571  129.600006  46.169998
2  2347167796  4/3/2016 11:59:59 PM    True  159.985870   63.400002  24.770000
3  2873212765  4/6/2016 11:59:59 PM    True  162.584027   56.700001  21.450001
4  2873212765  4/7/2016 11:59:59 PM    True  162.543299   57.200001  21.650000

In [36]:
df_hr_s.head()

           id            timestamp   hr
0  2022484408  4/1/2016 7:54:00 AM   93
1  2022484408  4/1/2016 7:54:05 AM   91
2  2022484408  4/1/2016 7:54:10 AM   96
3  2022484408  4/1/2016 7:54:15 AM   98
4  2022484408  4/1/2016 7:54:20 AM  100

In [37]:
df_m.head()

           id              timestamp  steps  calories  intensity  mets
0  1503960366  3/12/2016 12:00:00 AM      0    0.7973          0    10
1  1503960366  3/12/2016 12:01:00 AM      0    0.7973          0    10
2  1503960366  3/12/2016 12:02:00 AM      0    0.7973          0    10
3  1503960366  3/12/2016 12:03:00 AM      0    0.7973          0    10
4  1503960366  3/12/2016 12:04:00 AM      0    0.7973          0    10

In [38]:
df_h.head()

,id,timestamp,steps,calories,intensity_total,intensity_avg
0,1503960366,3/12/2016 12:00:00 AM,0,48,0,0.0
1,1503960366,3/12/2016 1:00:00 AM,0,48,0,0.0
2,1503960366,3/12/2016 2:00:00 AM,0,48,0,0.0
3,1503960366,3/12/2016 3:00:00 AM,0,48,0,0.0
4,1503960366,3/12/2016 4:00:00 AM,0,48,0,0.0

### Output Data

In [40]:
# output to csv

df_activity.to_csv(clean_path + 'activity.csv',index=False)
df_weight.to_csv(clean_path + 'weight.csv',index=False)

df_hr_s.to_csv(clean_path + 'seconds.csv',index=False)
df_m.to_csv(clean_path + 'minutes.csv',index=False)
df_h.to_csv(clean_path + 'hours.csv',index=False)